Revit 2027 API
VertexFormat Constructor
 Constructs the specification of vertex format from a numerical representation.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexFormat(
	VertexFormatBits vertexFormatBits
)
Public Sub New (
	vertexFormatBits As VertexFormatBits
)
public:
VertexFormat(
	VertexFormatBits vertexFormatBits
)
new :
        vertexFormatBits : VertexFormatBits -> VertexFormat
Parameters
vertexFormatBits VertexFormatBits
 The numerical representation of the vertex format.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This VertexFormat is not available because Revit is not currently rendering. In general, this VertexFormat must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace